In [1]:
import numpy as np
import pandas as pd

# I. SERIES

## A. From List

### 1. Integer

#### a. Membuat Data Series

In [2]:
x = [9,2,5,3,4,5,7,4,3,5,7]
y = pd.Series(np.array(x))
y

0     9
1     2
2     5
3     3
4     4
5     5
6     7
7     4
8     3
9     5
10    7
dtype: int32

#### b. Memanggil data series di index tertentu

In [3]:
y[9]

5

#### c. Ngeubah index dan ngasih nama listnya

In [4]:
x = [9,2,5,3,4]
y = pd.Series(
    np.array(x),
    index = ['a', 'b', 'c', 'd', 'e'],
    name = 'Test')
y

a    9
b    2
c    5
d    3
e    4
Name: Test, dtype: int32

#### d. Memanggil data series di index tertentu setelah nama index diubah

In [5]:
y['b']

2

### 2. String

#### a. Membuat Data Series

In [6]:
x = ['Andi', 'Budi', 'Caca']
y = pd.Series(np.array(x))
y

0    Andi
1    Budi
2    Caca
dtype: object

#### b. Slicing

In [7]:
y[0::2]

0    Andi
2    Caca
dtype: object

## B. From Dictionary

### 1. Membuat Data Series

In [8]:
y = pd.Series(
    data  = {'a':2, 'b': 30},
    name = 'Test')
y

a     2
b    30
Name: Test, dtype: int64

### 2. Slicing

In [9]:
y['b']

30

# II. DATA FRAME

## A. Data Frame 1 Dimensi

### 1. List

#### a. Data Frame 1 Kolom

##### i. Membuat Data Frame

In [10]:
x = [2,4,6,8,10]
df = pd.DataFrame(x)
df

    0
0   2
1   4
2   6
3   8
4  10

##### ii. Mengubah nama kolom

In [11]:
x = [2,4,6,8,10]
df = pd.DataFrame(x, columns=['Nilai'])
df

   Nilai
0      2
1      4
2      6
3      8
4     10

##### iii. Ngecek Shapenya

###### - Keseluruhan

In [12]:
#Ngececk shapenya
# (baris, kolom)
df.shape

(5, 1)

###### - Hanya baris atau kolomnya aja

In [13]:
# bisa juga panggil baris atau kolomnya aja
baris, kolom=df.shape
kolom

1

#### b. Data Frame lebih dari 1 Kolom

In [14]:
x = [2,4,6,8,10]
y = [1,3,5,7,9]
df = pd.DataFrame([x,y])
df

   0  1  2  3   4
0  2  4  6  8  10
1  1  3  5  7   9

##### i. Variabelnya dijadiin sebagai kolomnya

###### Cara 1: Dibuat berpasang-pasangan dulu

In [15]:
# Kalo mau digabung jadi kolom x dan y aja, maka harus dibuat berpasang-pasangan dulu
x = [2,4,6,8,10]
y = [1,3,5,7,9]
z = list(map(lambda a, b: [a, b], x, y))
df = pd.DataFrame(z)
df

    0  1
0   2  1
1   4  3
2   6  5
3   8  7
4  10  9

###### Cara 2: Dibuat dataframe kosong lalu dimasukin satu-satu

In [16]:
x = [2,4,6,8,10]
y = [1,3,5,7,9]

df = pd.DataFrame()
df['X'] = x
df['Y'] = y
df

    X  Y
0   2  1
1   4  3
2   6  5
3   8  7
4  10  9

##### ii. Mencacah string menjadi list

In [17]:
x = [2,4,6,8,10]
y = [1,3,5,7,9]
z = 'David'

df = pd.DataFrame()
df['X'] = x
df['Y'] = y
df['Z'] = list(z)
df

    X  Y  Z
0   2  1  D
1   4  3  a
2   6  5  v
3   8  7  i
4  10  9  d

### 2. Array

In [18]:
x = [2,4,6,8,10]
x = np.array(x)
df = pd.DataFrame(x)
df

    0
0   2
1   4
2   6
3   8
4  10

## B. Data Frame 2 Dimensi

### 1. List of List

In [19]:
data = [
    ['Andi', 'Jakarta', 'PNS'],
    ['Budi', 'Jakarta', 'Karyawan Swasta'],
    ['Caca', 'Jakarta', 'Ibu Rumah Tangga']
]

dfData = pd.DataFrame(
    data,
    index= np.arange(1,4),
    columns=['Nama', 'Kota', 'Pekerjaan']
)
dfData

   Nama     Kota         Pekerjaan
1  Andi  Jakarta               PNS
2  Budi  Jakarta   Karyawan Swasta
3  Caca  Jakarta  Ibu Rumah Tangga

### 2. List in Dictionary

In [20]:
data = {
    'x': [123, 321, 213], 'y': [234, 432, 324], 'z': [345, 543, 435]
}
df = pd.DataFrame(data, index = np.arange(1,len(data)+1))
df

     x    y    z
1  123  234  345
2  321  432  543
3  213  324  435

### 3. Dictionary in List (json)

In [21]:
data = [
    {'nama': 'Andi', 'kota': 'Jakarta'},
    {'nama': 'Andi', 'kota': 'Jakarta', 'job': np.nan},  # NaN beneran
    {'nama': 'Andi', 'kota': 'Jakarta', 'job': 'NaN'},   # NaN bohongan
    {'nama': 'Andi', 'kota': 'Jakarta', 'job': 'PNS'}
]

df = pd.DataFrame(data, index= np.arange(1, len(data)+1))
df

   nama     kota  job
1  Andi  Jakarta  NaN
2  Andi  Jakarta  NaN
3  Andi  Jakarta  NaN
4  Andi  Jakarta  PNS

### 4. Data Frame of Series

#### Cara 1

In [22]:
x = [1,2,3,4,5]
x = pd.Series(x, name='Test')
y = [1,2,3,4,5]
y = pd.Series(y, name='Try')
df = pd.DataFrame({
    'Col.X': x,
    'Col.Y': y
})
df

   Col.X  Col.Y
0      1      1
1      2      2
2      3      3
3      4      4
4      5      5

#### Cara 2

In [23]:
x = [1,2,3,4,5]
x = pd.Series(x, name='Test')
y = [1,2,3,4,5]
y = pd.Series(y, name='Try')
df = pd.DataFrame({
    x.name: x,
    y.name: y
})
df

   Test  Try
0     1    1
1     2    2
2     3    3
3     4    4
4     5    5

#### Cara 3

In [24]:
x = [1,2,3,4,5]
x = pd.Series(x, name='Test')
y = [1,2,3,4,5]
y = pd.Series(y, name='Try')
df = pd.DataFrame([x,y])
df.transpose()

   Test  Try
0     1    1
1     2    2
2     3    3
3     4    4
4     5    5

# III. FITUR-FITUR

In [25]:
df = pd.DataFrame({
    'A': np.arange(20, 26),
    'B': [32, 4, 12, 54, 21, 18],
    'C': np.random.rand(6),
    'D': np.ones(6)
}, index = list('abcdef'))
df

    A   B         C    D
a  20  32  0.188424  1.0
b  21   4  0.027269  1.0
c  22  12  0.744837  1.0
d  23  54  0.218367  1.0
e  24  21  0.946828  1.0
f  25  18  0.694704  1.0

## A. Manggil sekian data

### 1. Dari awal index

In [26]:
df.head(3)

    A   B         C    D
a  20  32  0.188424  1.0
b  21   4  0.027269  1.0
c  22  12  0.744837  1.0

### 2. Dari akhir index

In [27]:
df.tail(3)

    A   B         C    D
d  23  54  0.218367  1.0
e  24  21  0.946828  1.0
f  25  18  0.694704  1.0

## B. Melihat list index & Kolom

### 1. List indexnya

In [28]:
list(df.index)

['a', 'b', 'c', 'd', 'e', 'f']

### 2.List kolomnya

In [29]:
list(df.columns)

['A', 'B', 'C', 'D']

## C. Melihat Values dari Data Frame

In [30]:
df.values

array([[2.00000000e+01, 3.20000000e+01, 1.88424110e-01, 1.00000000e+00],
       [2.10000000e+01, 4.00000000e+00, 2.72690081e-02, 1.00000000e+00],
       [2.20000000e+01, 1.20000000e+01, 7.44836878e-01, 1.00000000e+00],
       [2.30000000e+01, 5.40000000e+01, 2.18366807e-01, 1.00000000e+00],
       [2.40000000e+01, 2.10000000e+01, 9.46828021e-01, 1.00000000e+00],
       [2.50000000e+01, 1.80000000e+01, 6.94704396e-01, 1.00000000e+00]])

## D. Melihat Insight Data Frame

In [31]:
df.describe()

               A          B         C    D
count   6.000000   6.000000  6.000000  6.0
mean   22.500000  23.500000  0.470072  1.0
std     1.870829  17.615334  0.372023  0.0
min    20.000000   4.000000  0.027269  1.0
25%    21.250000  13.500000  0.195910  1.0
50%    22.500000  19.500000  0.456536  1.0
75%    23.750000  29.250000  0.732304  1.0
max    25.000000  54.000000  0.946828  1.0

## E. Membalik urutan data

### 1. Berdasarkan Index

In [32]:
df.sort_index(ascending=False)

    A   B         C    D
f  25  18  0.694704  1.0
e  24  21  0.946828  1.0
d  23  54  0.218367  1.0
c  22  12  0.744837  1.0
b  21   4  0.027269  1.0
a  20  32  0.188424  1.0

### 2. Berdasarkan Kolom

In [33]:
df.sort_index(ascending=False, axis=1)

     D         C   B   A
a  1.0  0.188424  32  20
b  1.0  0.027269   4  21
c  1.0  0.744837  12  22
d  1.0  0.218367  54  23
e  1.0  0.946828  21  24
f  1.0  0.694704  18  25

Cara alternatif buat assign value

In [34]:
df.sort_index(ascending=False, axis=1, inplace=True)
df

     D         C   B   A
a  1.0  0.188424  32  20
b  1.0  0.027269   4  21
c  1.0  0.744837  12  22
d  1.0  0.218367  54  23
e  1.0  0.946828  21  24
f  1.0  0.694704  18  25

## F. Mengurutkan Data

In [35]:
df = pd.DataFrame({
    'A': np.array([20, 20, 20, 21, 21, 21]),
    'B': [32, 4, 12, 54, 21, 18],
    'C': np.random.rand(6),
    'D': np.ones(6)
}, index = list('abcdef'))
df

    A   B         C    D
a  20  32  0.877714  1.0
b  20   4  0.643555  1.0
c  20  12  0.870389  1.0
d  21  54  0.571378  1.0
e  21  21  0.944851  1.0
f  21  18  0.767189  1.0

### 1. Berdasarkan Valuenya

In [36]:
df.sort_values(by='C')

    A   B         C    D
d  21  54  0.571378  1.0
b  20   4  0.643555  1.0
f  21  18  0.767189  1.0
c  20  12  0.870389  1.0
a  20  32  0.877714  1.0
e  21  21  0.944851  1.0

### 2. Membalik urutan berdasarkan valuenya

In [37]:
df.sort_values(by='C', ascending=False)

    A   B         C    D
e  21  21  0.944851  1.0
a  20  32  0.877714  1.0
c  20  12  0.870389  1.0
f  21  18  0.767189  1.0
b  20   4  0.643555  1.0
d  21  54  0.571378  1.0

### 3. Berdasarkan A dulu baru setelah itu B

In [38]:
df.sort_values(by=['A', 'B'])

    A   B         C    D
b  20   4  0.643555  1.0
c  20  12  0.870389  1.0
a  20  32  0.877714  1.0
f  21  18  0.767189  1.0
e  21  21  0.944851  1.0
d  21  54  0.571378  1.0

### 4. Berdasarkan A dulu baru setelah itu B nya descending

In [39]:
df.sort_values(by=['A', 'B'], ascending=[True, False])

    A   B         C    D
a  20  32  0.877714  1.0
c  20  12  0.870389  1.0
b  20   4  0.643555  1.0
d  21  54  0.571378  1.0
e  21  21  0.944851  1.0
f  21  18  0.767189  1.0

## G. Memanggil Data

### 1. By Column

In [40]:
df[['A', 'C']]

    A         C
a  20  0.877714
b  20  0.643555
c  20  0.870389
d  21  0.571378
e  21  0.944851
f  21  0.767189

### 2. By Index

In [41]:
df[::2]

    A   B         C    D
a  20  32  0.877714  1.0
c  20  12  0.870389  1.0
e  21  21  0.944851  1.0

### 3. By Name

#### a. Semua data di index tertentu

In [42]:
df = pd.DataFrame({
    'A': np.array([20, 20, 20, 21, 21, 21]),
    'B': [32, 4, 12, 54, 21, 18],
    'C': np.random.rand(6),
    'D': np.ones(6)
})

df.loc[0]

A    20.000000
B    32.000000
C     0.028304
D     1.000000
Name: 0, dtype: float64

#### b. Data di index tertentu yg ada di kolom tertentu

In [43]:
df.loc[0, 'C']

0.028303668954105077

#### c. Data di index tertentu yg ada di beberapa kolom tertentu

In [44]:
df.loc[0, ['B', 'D']]

B    32.0
D     1.0
Name: 0, dtype: float64

### 4. By Urutan

#### a. semua data di index tertentu

In [45]:
df.index = list('abcdef')
df

df.iloc[0]

A    20.000000
B    32.000000
C     0.028304
D     1.000000
Name: a, dtype: float64

#### b. Data column tertentu di index tertentu

In [46]:
df.iloc[0, 1]

32

#### c. Data column ke-berapa sampe berapa di index ke-berapa sampe berapa

In [47]:
df.iloc[3:5, 0:3]

    A   B         C
d  21  54  0.164501
e  21  21  0.866673

## H. Mengubah kolom tertentu jadi index

### 1. Kolom lamanya hilang

In [48]:
df.set_index('C')

           A   B    D
C
0.028304  20  32  1.0
0.906797  20   4  1.0
0.394163  20  12  1.0
0.164501  21  54  1.0
0.866673  21  21  1.0
0.070236  21  18  1.0

### 2. Kolom lamanya tetap ada

In [49]:
df = pd.DataFrame({
    'A': np.array([20, 20, 20, 21, 21, 21]),
    'B': [32, 4, 12, 54, 21, 18],
    'C': np.random.rand(6),
    'D': np.ones(6)
})

df.index = df['C']
df

           A   B         C    D
C
0.790548  20  32  0.790548  1.0
0.989406  20   4  0.989406  1.0
0.145868  20  12  0.145868  1.0
0.929416  21  54  0.929416  1.0
0.665644  21  21  0.665644  1.0
0.917042  21  18  0.917042  1.0

## I. Mengubah nama kolom

In [50]:
df.columns = ['Nama', 'Nilai', 'Value', 'Rangking']
df

          Nama  Nilai     Value  Rangking
C
0.790548    20     32  0.790548       1.0
0.989406    20      4  0.989406       1.0
0.145868    20     12  0.145868       1.0
0.929416    21     54  0.929416       1.0
0.665644    21     21  0.665644       1.0
0.917042    21     18  0.917042       1.0

## J. Multiple Filter
Sort berdasarkan Nilai dan Value lalu tampilkan berdasarkan Nama dan Nilai

In [51]:
df.iloc[::2].sort_values(
    by = ['Nilai', 'Value'],
    ascending = [False, True]
)[['Nama', 'Nilai']]

          Nama  Nilai
C
0.790548    20     32
0.665644    21     21
0.145868    20     12

# IV. MEMBACA DATA FRAME DARI FILE LAIN

##  A. CSV

In [52]:
mydf = pd.read_csv('data.csv')
mydf

   no  nama     kota
0   1  Andi  Jakarta
1   2  Budi  Bandung
2   3  Caca  Jakarta

## B. Excel

In [53]:
df = pd.read_excel('data.xlsx')
df

   no  nama     kota
0   1  Andi  Jakarta
1   2  Budi  Bandung
2   3  Caca  Jakarta

## C. Json

In [54]:
df = pd.read_json('data.json')
df

   no  nama     kota
0   1  Andi  Jakarta
1   2  Budi    Bogor
2   3  Caca    Depok